(gdb) b main
Breakpoint 1 at 0x7b1: file p1original.c, line 16.
(gdb) r
Starting program: /home/runner/pps-IA1-practice/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p1original.c:16
16   { 
(gdb) n
18   input(&a,&b);
(gdb) n
enter the number:5
6
19   add(a,b,&sum);
(gdb) n
20   output(a,b,sum);
(gdb) p
The history is empty.
(gdb) n
21   return 0;
(gdb) c
Continuing.
sum of 5+6 is 11n[Inferior 1 (process 784) exited normally]
(gdb)
